app/views/dojos/_form.html.erb

    <div class="input-field col s6">
      <%= form.select :id_manager, options_for_select(all_managers.collect{|manager| [manager.first_name, manager.id]}), class:'custom-select' %>
---
SELECT "managers".* FROM "managers"