app/controllers/dojos_controller.rb

SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_dojo
      @dojo = Dojo.find(params[:id])